{"_type":"project","title":"Webová agentura Creatify","description":"Moderní webová prezentace pro kreativní agenturu – důraz na rychlost, čistý design a snadnou editaci obsahu."}
{"_type":"project","title":"SaaS Dashboard pro správu klientů","description":"Webová aplikace pro správu klientů s přehledným dashboardem, statistikami a zabezpečeným přístupem pro tým."}
{"_type":"project","title":"Online kurz „Základy programování“","description":"Platforma pro online kurz s lekcemi, kvízy, uživatelskými účty a přehledem postupu studia."}
{"_type":"project","title":"Pronájem techniky EasyRent","description":"Prezentace služby krátkodobého pronájmu notebooků a techniky pro firmy i jednotlivce s možností online poptávky."}
{"_type":"project","title":"Osobní blog vývojáře","description":"Rychlý blog pro sdílení článků o vývoji webu, tipů, návodů a případových studií – optimalizovaný pro SEO."}
{"_type":"project","title":"Prezentace menší firmy","description":"Jednoduchý one-page web pro malou firmu – kontakty, služby, reference a formulář poptávky."}
{"_id":"project-kavarna-na-ruzku","_type":"project","title":"Kavárna Na Růžku – moderní web pro lokální podnik","slug":{"_type":"slug","current":"kavarna-na-ruzku"},"shortDescription":"Jednostránkový web pro útulnou kavárnu s důrazem na atmosféru a jednoduchou rezervaci.","description":"Kavárna Na Růžku je malý lokální podnik, který potřeboval jednoduchý, ale vizuálně výrazný web. Cílem bylo odlišit se od konkurence v okolí, ukázat atmosféru místa a usnadnit zákazníkům zjištění otevírací doby, menu a možnost rezervace stolku.","url":"","goal":"Vytvořit přehledný a rychlý web, který bude fungovat jako digitální vizitka kavárny. Zdůraznit atmosféru interiéru, nabídku kávy a domácích dezertů a umožnit zákazníkům jednoduše zjistit vše podstatné včetně kontaktů a možností rezervací.","workflow":["Úvodní schůzka a definice cílové skupiny (studenti, pracující z okolí, maminky s dětmi).","Příprava wireframů – struktura sekcí: Úvod, Menu, Fotogalerie, O nás, Kontakt.","Tvorba vizuálního stylu – barevná paleta inspirovaná kávou (hnědá, béžová, krémová) a pastelové akcenty.","Implementace v Next.js + Tailwind CSS, optimalizace pro mobilní telefony.","Napojení CMS (Sanity) pro snadnou správu menu a fotek.","Testování rychlosti, SEO a základní analytiky (Google Analytics)."],"results":"Po spuštění webu začala kavárna získávat více dotazů přes formulář a noví zákazníci často zmiňují, že si podnik našli díky webu. Majitelé oceňují, že mohou sami upravovat menu a fotky bez zásahu programátora.","features":["Jednostránkový responzivní web v Next.js.","Napojení na Sanity pro správu menu, fotek a otevírací doby.","Vizuálně silná hero sekce s fotkou interiéru.","Jednoduchý rezervační formulář.","Základní SEO a napojení na Google Analytics."],"gallery":[],"client":"Kavárna Na Růžku","year":2024,"order":1}
{"_id":"project-ux-portfolio","_type":"project","title":"Portfolio UX designéra – osobní značka","slug":{"_type":"slug","current":"ux-portfolio"},"shortDescription":"Osobní web UX/UI designéra s důrazem na case-studies a přehled služeb.","description":"UX designér potřeboval profesionální online portfolio, které by ukázalo jeho projekty, proces práce a výsledky v podobě reálných dopadů na byznys klientů. Web slouží jako hlavní místo, kam odkazuje z LinkedInu a Dribbble.","url":"","goal":"Připravit přehledný web, který neprodává jen obrázky, ale hlavně způsob přemýšlení designéra – výzkum, prototypování, testování a finální řešení.","workflow":["Audit stávajících materiálů – starý web, PDF prezentace, ukázky z Figmy.","Definice struktury portfolia – case-studies, o mně, proces, reference, kontakt.","Návrh moderního dark-mode designu s důrazem na typografii a dostatek whitespace.","Implementace v Next.js + Tailwind, animace pomocí Framer Motion.","Napojení CMS (Sanity) pro správu projektů a článků.","Optimalizace výkonu a základní SEO nastavení."],"results":"Po spuštění nového portfolia se zvýšil počet kvalitních poptávek, designér získal několik dlouhodobých klientů a web slouží jako hlavní podklad při výběrových řízeních.","features":["Dark-mode portfolio s animovanou hero sekcí.","Strukturované case-studies (problém → proces → řešení → výsledek).","Sekce „Proces spolupráce“ srozumitelně vysvětlená pro nové klienty.","Snadná editace projektů a článků v Sanity."],"gallery":[],"client":"Freelance UX designér","year":2023,"order":2}
{"_id":"project-nordicdecor-eshop","_type":"project","title":"NordicDecor – minimalistický e-shop s doplňky do bytu","slug":{"_type":"slug","current":"nordicdecor-eshop"},"shortDescription":"Rychlý a přehledný e-shop s bytovými doplňky ve skandinávském stylu.","description":"NordicDecor je menší e-shop s bytovými doplňky, který chtěl vyměnit generickou šablonu za vlastní, rychlé a čisté řešení. Důraz byl na produktové fotky, filtrování a jednoduchý proces nákupu.","url":"","goal":"Zvýšit důvěryhodnost e-shopu a díky lepšímu UX zvýšit počet dokončených objednávek a snížit počet opuštěných košíků.","workflow":["Analýza stávajícího e-shopu a identifikace slabých míst v nákupním procesu.","Návrh nové informační architektury kategorií a filtrů.","Design UI – produktový grid, velké fotky, minimalistická barevná paleta.","Implementace frontendu v Next.js, napojení na existující backend/API.","Optimalizace produktových fotek, lazy-loading obrázků.","A/B testování variant detailu produktu a pokladny."],"results":"Po nasazení nové verze e-shopu se zvýšil konverzní poměr o ~18 % a snížil se počet opuštěných košíků. Zákazníci v recenzích chválí přehlednost a jednoduchost nákupu.","features":["Moderní produktový grid s filtrováním a řazením.","Detail produktu s velkými fotkami a doporučenými produkty.","Responzivní design optimalizovaný pro mobilní uživatele.","Napojení na analytiku pro sledování chování zákazníků."],"gallery":[],"client":"NordicDecor","year":2022,"order":3}
